In [2]:
import pandas as pd
import numpy as np

What is the average of column num2?

In [11]:

table1 = pd.DataFrame( [
["2014-01-15","176","631.427747","boy","yellow"],
["2014-01-25","330","525.189511","girl","yellow"],
["2014-03-05","260","802.829888","boy","blue"],
["2014-03-27","192","743.697401","girl","red"],
["2014-05-19","254","974.793224","girl","blue"],
["2014-05-27","943","186.433405","girl","yellow"],
["2014-06-19","589","346.259034","boy","green"],
["2014-07-04","690","527.358344","boy","red"],
["2014-08-03","792","73.843848","boy","red"],
["2014-08-06","760","286.984863","girl","red"],
["2014-08-08","71","20.700987","boy","green"],
["2014-09-02","312","845.254480","boy","purple"],
["2014-09-06","279","833.293450","boy","green"],
["2014-09-11","852","473.570358","boy","red"],
["2014-09-21","285","915.997882","girl","red"],
["2014-10-20","330","679.031792","boy","purple"],
["2014-11-06","56","155.091492","boy","red"],
["2014-11-19","518","58.936581","boy","red"],
["2014-12-19","610","899.197993","boy","red"],
["2014-12-19","462","387.648537","girl","blue"],
["2014-12-25","654","346.042252","girl","yellow"],
["2015-02-04","151","421.636419","girl","red"],
["2015-03-15","413","606.343760","girl","yellow"],
["2015-03-25","226","405.178703","boy","green"],
["2015-05-27","954","4.158206","boy","yellow"],
["2015-07-22","493","164.797598","boy","red"],
["2015-08-05","687","277.021994","girl","red"],
["2015-08-12","619","658.618907","boy","blue"],
["2015-08-16","951","724.661845","girl","red"],
["2015-09-21","345","707.051491","girl","red"],
["2015-09-21","250","571.183941","girl","yellow"],
["2015-09-28","940","113.609364","girl","yellow"],
["2015-10-11","918","359.947587","boy","blue"],
["2015-10-29","722","812.100866","boy","purple"],
["2015-10-30","31","566.706857","girl","purple"],
["2015-10-30","638","919.542215","boy","yellow"],
["2015-11-20","456","405.277955","girl","yellow"],
["2015-11-21","965","127.128332","girl","blue"],
["2016-01-04","894","862.674515","girl","red"],
["2016-01-14","133","673.018684","boy","red"],
["2016-03-17","471","533.197723","girl","red"],
["2016-06-07","625","665.043979","boy","red"],
["2016-06-26","545","799.731411","girl","blue"],
["2016-06-29","639","54.200219","girl","green"],
["2016-07-09","6","63.016883","girl","purple"],
["2016-08-16","93","567.060474","girl","yellow"],
["2016-08-26","16","319.226372","girl","purple"],
["2016-09-05","315","116.141924","girl","red"],
["2016-09-20","105","476.725011","girl","red"],
["2016-09-26","305","892.255753","boy","green"]],
   columns = ["date","num","num2","str","str2"])

In [12]:
table1.head()

         date  num        num2   str    str2
0  2014-01-15  176  631.427747   boy  yellow
1  2014-01-25  330  525.189511  girl  yellow
2  2014-03-05  260  802.829888   boy    blue
3  2014-03-27  192  743.697401  girl     red
4  2014-05-19  254  974.793224  girl    blue

In [17]:

table0= pd.DataFrame( [
["2014-01-15","176","631.427747","boy","yellow"],
["2014-01-25","330","525.189511","girl","yellow"],
["2014-03-05","260","802.829888","boy","blue"]],
   columns = ["date","num","num2","str","str2"])
table0.head()
table0['num'].

         date  num        num2   str    str2
0  2014-01-15  176  631.427747   boy  yellow
1  2014-01-25  330  525.189511  girl  yellow
2  2014-03-05  260  802.829888   boy    blue